JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm7.cpp
//*****************************************************************************
// MIMXRT1189_cm7 startup code for use with MCUXpresso IDE
//
// Version : 211221
//*****************************************************************************
//
// Copyright 2016-2021 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void TMR1_IRQHandler(void);
WEAK void DAP_IRQHandler(void);
WEAK void M7_CTI_TRIGGER_OUTPUT_IRQHandler(void);
WEAK void M33_CTI_TRIGGER_OUTPUT_IRQHandler(void);
WEAK void TMR5_IRQHandler(void);
WEAK void TMR6_IRQHandler(void);
WEAK void TMR7_IRQHandler(void);
WEAK void TMR8_IRQHandler(void);
WEAK void CAN1_IRQHandler(void);
WEAK void CAN1_ERROR_IRQHandler(void);
WEAK void GPIO1_0_IRQHandler(void);
WEAK void GPIO1_1_IRQHandler(void);
WEAK void I3C1_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void LPI2C2_IRQHandler(void);
WEAK void LPIT1_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPTMR1_IRQHandler(void);
WEAK void LPUART1_IRQHandler(void);
WEAK void LPUART2_IRQHandler(void);
WEAK void MU1_IRQHandler(void);
WEAK void MU2_IRQHandler(void);
WEAK void PWM1_FAULT_IRQHandler(void);
WEAK void PWM1_0_IRQHandler(void);
WEAK void PWM1_1_IRQHandler(void);
WEAK void PWM1_2_IRQHandler(void);
WEAK void PWM1_3_IRQHandler(void);
WEAK void SENTINEL_TRUST_MUA_RX_FULL_IRQHandler(void);
WEAK void SENTINEL_TRUST_MUA_TX_EMPTY_IRQHandler(void);
WEAK void SENTINEL_APPS_CORE_MUA_RX_FULL_IRQHandler(void);
WEAK void SENTINEL_APPS_CORE_MUA_TX_EMPTY_IRQHandler(void);
WEAK void SENTINEL_REALTIME_CORE_MUA_RX_FULL_IRQHandler(void);
WEAK void SENTINEL_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler(void);
WEAK void SENTINEL_SECURE_IRQHandler(void);
WEAK void SENTINEL_NONSECURE_IRQHandler(void);
WEAK void TPM1_IRQHandler(void);
WEAK void TPM2_IRQHandler(void);
WEAK void RTWDOG1_IRQHandler(void);
WEAK void RTWDOG2_IRQHandler(void);
WEAK void Reserved56_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void PDM_HWVAD_ERROR_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void PDM_ERROR_IRQHandler(void);
WEAK void SAI1_IRQHandler(void);
WEAK void M33_PS_IRQHandler(void);
WEAK void M33_TCM_ECC_IRQHandler(void);
WEAK void M33_TCM_ERROR_IRQHandler(void);
WEAK void M7_TCM_ECC_IRQHandler(void);
WEAK void M7_TCM_ERROR_IRQHandler(void);
WEAK void CAN2_IRQHandler(void);
WEAK void CAN2_ERROR_IRQHandler(void);
WEAK void FLEXIO1_IRQHandler(void);
WEAK void FLEXIO2_IRQHandler(void);
WEAK void FLEXSPI1_IRQHandler(void);
WEAK void FLEXSPI2_IRQHandler(void);
WEAK void GPIO2_0_IRQHandler(void);
WEAK void GPIO2_1_IRQHandler(void);
WEAK void GPIO3_0_IRQHandler(void);
WEAK void GPIO3_1_IRQHandler(void);
WEAK void I3C2_IRQHandler(void);
WEAK void LPI2C3_IRQHandler(void);
WEAK void LPI2C4_IRQHandler(void);
WEAK void LPIT2_IRQHandler(void);
WEAK void LPSPI3_IRQHandler(void);
WEAK void LPSPI4_IRQHandler(void);
WEAK void LPTMR2_IRQHandler(void);
WEAK void LPUART3_IRQHandler(void);
WEAK void LPUART4_IRQHandler(void);
WEAK void LPUART5_IRQHandler(void);
WEAK void LPUART6_IRQHandler(void);
WEAK void ASRC_IRQHandler(void);
WEAK void BBNSM_IRQHandler(void);
WEAK void SYS_CTRL1_IRQHandler(void);
WEAK void TPM3_IRQHandler(void);
WEAK void TPM4_IRQHandler(void);
WEAK void TPM5_IRQHandler(void);
WEAK void TPM6_IRQHandler(void);
WEAK void RTWDOG3_IRQHandler(void);
WEAK void RTWDOG4_IRQHandler(void);
WEAK void RTWDOG5_IRQHandler(void);
WEAK void Reserved98_IRQHandler(void);
WEAK void TEMPSENSOR_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void LDO_1P8_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void USDHC2_IRQHandler(void);
WEAK void Reserved104_IRQHandler(void);
WEAK void TMR2_IRQHandler(void);
WEAK void LDO_1P0_IRQHandler(void);
WEAK void MECC1_IRQHandler(void);
WEAK void MECC2_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void DMA_ERROR_IRQHandler(void);
WEAK void DMA_0_IRQHandler(void);
WEAK void DMA_1_IRQHandler(void);
WEAK void DMA_2_IRQHandler(void);
WEAK void DMA_3_IRQHandler(void);
WEAK void DMA_4_IRQHandler(void);
WEAK void DMA_5_IRQHandler(void);
WEAK void DMA_6_IRQHandler(void);
WEAK void DMA_7_IRQHandler(void);
WEAK void DMA_8_IRQHandler(void);
WEAK void DMA_9_IRQHandler(void);
WEAK void DMA_10_IRQHandler(void);
WEAK void DMA_11_IRQHandler(void);
WEAK void DMA_12_IRQHandler(void);
WEAK void DMA_13_IRQHandler(void);
WEAK void DMA_14_IRQHandler(void);
WEAK void DMA_15_IRQHandler(void);
WEAK void DMA_16_IRQHandler(void);
WEAK void DMA_17_IRQHandler(void);
WEAK void DMA_18_IRQHandler(void);
WEAK void DMA_19_IRQHandler(void);
WEAK void DMA_20_IRQHandler(void);
WEAK void DMA_21_IRQHandler(void);
WEAK void DMA_22_IRQHandler(void);
WEAK void DMA_23_IRQHandler(void);
WEAK void DMA_24_IRQHandler(void);
WEAK void DMA_25_IRQHandler(void);
WEAK void DMA_26_IRQHandler(void);
WEAK void DMA_27_IRQHandler(void);
WEAK void DMA_28_IRQHandler(void);
WEAK void DMA_29_IRQHandler(void);
WEAK void DMA_30_IRQHandler(void);
WEAK void DMA_31_IRQHandler(void);
WEAK void DMA4_ERROR_IRQHandler(void);
WEAK void DMA4_0_1_IRQHandler(void);
WEAK void DMA4_2_3_IRQHandler(void);
WEAK void DMA4_4_5_IRQHandler(void);
WEAK void DMA4_6_7_IRQHandler(void);
WEAK void DMA4_8_9_IRQHandler(void);
WEAK void DMA4_10_11_IRQHandler(void);
WEAK void DMA4_12_13_IRQHandler(void);
WEAK void DMA4_14_15_IRQHandler(void);
WEAK void DMA4_16_17_IRQHandler(void);
WEAK void DMA4_18_19_IRQHandler(void);
WEAK void DMA4_20_21_IRQHandler(void);
WEAK void DMA4_22_23_IRQHandler(void);
WEAK void DMA4_24_25_IRQHandler(void);
WEAK void DMA4_26_27_IRQHandler(void);
WEAK void DMA4_28_29_IRQHandler(void);
WEAK void DMA4_30_31_IRQHandler(void);
WEAK void Reserved160_IRQHandler(void);
WEAK void Reserved161_IRQHandler(void);
WEAK void Reserved162_IRQHandler(void);
WEAK void Reserved163_IRQHandler(void);
WEAK void Reserved164_IRQHandler(void);
WEAK void Reserved165_IRQHandler(void);
WEAK void Reserved166_IRQHandler(void);
WEAK void Reserved167_IRQHandler(void);
WEAK void LPI2C5_IRQHandler(void);
WEAK void LPI2C6_IRQHandler(void);
WEAK void SAI4_IRQHandler(void);
WEAK void SPDIF_IRQHandler(void);
WEAK void LPUART9_IRQHandler(void);
WEAK void LPUART10_IRQHandler(void);
WEAK void LPUART11_IRQHandler(void);
WEAK void LPUART12_IRQHandler(void);
WEAK void Reserved176_IRQHandler(void);
WEAK void Reserved177_IRQHandler(void);
WEAK void Reserved178_IRQHandler(void);
WEAK void Reserved179_IRQHandler(void);
WEAK void TMR3_IRQHandler(void);
WEAK void TMR4_IRQHandler(void);
WEAK void M33_SYSRESET_REQ_IRQHandler(void);
WEAK void M33_LOCKUP_IRQHandler(void);
WEAK void M7_SYSRESET_REQ_IRQHandler(void);
WEAK void M7_LOCKUP_IRQHandler(void);
WEAK void PWM2_FAULT_IRQHandler(void);
WEAK void PWM2_0_IRQHandler(void);
WEAK void PWM2_1_IRQHandler(void);
WEAK void PWM2_2_IRQHandler(void);
WEAK void PWM2_3_IRQHandler(void);
WEAK void PWM3_FAULT_IRQHandler(void);
WEAK void PWM3_0_IRQHandler(void);
WEAK void PWM3_1_IRQHandler(void);
WEAK void PWM3_2_IRQHandler(void);
WEAK void PWM3_3_IRQHandler(void);
WEAK void PWM4_FAULT_IRQHandler(void);
WEAK void PWM4_0_IRQHandler(void);
WEAK void PWM4_1_IRQHandler(void);
WEAK void PWM4_2_IRQHandler(void);
WEAK void PWM4_3_IRQHandler(void);
WEAK void EQDC1_IRQHandler(void);
WEAK void EQDC2_IRQHandler(void);
WEAK void EQDC3_IRQHandler(void);
WEAK void EQDC4_IRQHandler(void);
WEAK void ADC2_IRQHandler(void);
WEAK void DCDC_IRQHandler(void);
WEAK void CAN3_IRQHandler(void);
WEAK void CAN3_ERROR_IRQHandler(void);
WEAK void DAC_IRQHandler(void);
WEAK void LPSPI5_IRQHandler(void);
WEAK void LPSPI6_IRQHandler(void);
WEAK void LPUART7_IRQHandler(void);
WEAK void LPUART8_IRQHandler(void);
WEAK void SAI2_IRQHandler(void);
WEAK void SAI3_IRQHandler(void);
WEAK void ACMP1_IRQHandler(void);
WEAK void ACMP2_IRQHandler(void);
WEAK void ACMP3_IRQHandler(void);
WEAK void ACMP4_IRQHandler(void);
WEAK void Reserved220_IRQHandler(void);
WEAK void Reserved221_IRQHandler(void);
WEAK void Reserved222_IRQHandler(void);
WEAK void Reserved223_IRQHandler(void);
WEAK void Reserved224_IRQHandler(void);
WEAK void GPT1_IRQHandler(void);
WEAK void GPT2_IRQHandler(void);
WEAK void KPP_IRQHandler(void);
WEAK void USBPHY1_IRQHandler(void);
WEAK void USBPHY2_IRQHandler(void);
WEAK void USB_OTG2_IRQHandler(void);
WEAK void USB_OTG1_IRQHandler(void);
WEAK void XSPI_SLV_IRQHandler(void);
WEAK void NETC_IRQHandler(void);
WEAK void MSGINTR1_IRQHandler(void);
WEAK void MSGINTR2_IRQHandler(void);
WEAK void MSGINTR3_IRQHandler(void);
WEAK void MSGINTR4_IRQHandler(void);
WEAK void MSGINTR5_IRQHandler(void);
WEAK void MSGINTR6_IRQHandler(void);
WEAK void SINC1_0_IRQHandler(void);
WEAK void SINC1_1_IRQHandler(void);
WEAK void SINC1_2_IRQHandler(void);
WEAK void SINC1_3_IRQHandler(void);
WEAK void SINC2_0_IRQHandler(void);
WEAK void SINC2_1_IRQHandler(void);
WEAK void SINC2_2_IRQHandler(void);
WEAK void SINC2_3_IRQHandler(void);
WEAK void GPIO4_0_IRQHandler(void);
WEAK void GPIO4_1_IRQHandler(void);
WEAK void GPIO5_0_IRQHandler(void);
WEAK void GPIO5_1_IRQHandler(void);
WEAK void GPIO6_0_IRQHandler(void);
WEAK void GPIO6_1_IRQHandler(void);
WEAK void ECAT_IRQHandler(void);

