JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm7.cpp
//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void TMR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DAP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_CTI_TRIGGER_OUTPUT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_CTI_TRIGGER_OUTPUT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO1_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO1_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_TRUST_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_TRUST_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_APPS_CORE_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_APPS_CORE_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_REALTIME_CORE_MUA_RX_FULL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_REALTIME_CORE_MUA_TX_EMPTY_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_SECURE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENTINEL_NONSECURE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved56_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_PS_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_TCM_ECC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_TCM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_TCM_ECC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_TCM_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN2_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO2_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO2_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO3_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO3_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPIT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ASRC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void BBNSM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SYS_CTRL1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TPM6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTWDOG5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved98_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TEMPSENSOR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved100_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LDO_1P8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved104_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LDO_1P0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MECC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MECC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_16_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_17_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_18_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_19_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_20_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_21_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_22_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_23_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_24_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_25_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_26_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_27_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_28_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_29_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_30_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_31_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_0_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_2_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_4_5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_6_7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_8_9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_10_11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_12_13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_14_15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_16_17_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_18_19_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_20_21_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_22_23_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_24_25_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_26_27_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_28_29_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_30_31_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved160_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved161_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved162_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved163_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved164_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved165_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved166_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved167_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SPDIF_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved176_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved177_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved178_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved179_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TMR4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_SYSRESET_REQ_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M33_LOCKUP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_SYSRESET_REQ_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void M7_LOCKUP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM4_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EQDC4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DCDC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN3_ERROR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DAC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPUART8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved220_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved221_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved222_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved223_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved224_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void KPP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB_OTG2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB_OTG1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XSPI_SLV_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void NETC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MSGINTR6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC1_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SINC2_3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO4_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO4_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO5_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO5_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO6_0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO6_1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ECAT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

