JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm7.cpp
WEAK void PDM_EVENT_IRQHandler(void)
{   PDM_EVENT_DriverIRQHandler();
}

WEAK void PDM_ERROR_IRQHandler(void)
{   PDM_ERROR_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{   SAI1_DriverIRQHandler();
}

WEAK void M33_PS_IRQHandler(void)
{   M33_PS_DriverIRQHandler();
}

WEAK void M33_TCM_ECC_IRQHandler(void)
{   M33_TCM_ECC_DriverIRQHandler();
}

WEAK void M33_TCM_ERROR_IRQHandler(void)
{   M33_TCM_ERROR_DriverIRQHandler();
}

WEAK void M7_TCM_ECC_IRQHandler(void)
{   M7_TCM_ECC_DriverIRQHandler();
}

WEAK void M7_TCM_ERROR_IRQHandler(void)
{   M7_TCM_ERROR_DriverIRQHandler();
}

WEAK void CAN2_IRQHandler(void)
{   CAN2_DriverIRQHandler();
}

WEAK void CAN2_ERROR_IRQHandler(void)
{   CAN2_ERROR_DriverIRQHandler();
}

WEAK void FLEXIO1_IRQHandler(void)
{   FLEXIO1_DriverIRQHandler();
}

WEAK void FLEXIO2_IRQHandler(void)
{   FLEXIO2_DriverIRQHandler();
}

WEAK void FLEXSPI1_IRQHandler(void)
{   FLEXSPI1_DriverIRQHandler();
}

WEAK void FLEXSPI2_IRQHandler(void)
{   FLEXSPI2_DriverIRQHandler();
}

WEAK void GPIO2_0_IRQHandler(void)
{   GPIO2_0_DriverIRQHandler();
}

WEAK void GPIO2_1_IRQHandler(void)
{   GPIO2_1_DriverIRQHandler();
}

WEAK void GPIO3_0_IRQHandler(void)
{   GPIO3_0_DriverIRQHandler();
}

WEAK void GPIO3_1_IRQHandler(void)
{   GPIO3_1_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{   I3C2_DriverIRQHandler();
}

WEAK void LPI2C3_IRQHandler(void)
{   LPI2C3_DriverIRQHandler();
}

WEAK void LPI2C4_IRQHandler(void)
{   LPI2C4_DriverIRQHandler();
}

WEAK void LPIT2_IRQHandler(void)
{   LPIT2_DriverIRQHandler();
}

WEAK void LPSPI3_IRQHandler(void)
{   LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{   LPSPI4_DriverIRQHandler();
}

WEAK void LPTMR2_IRQHandler(void)
{   LPTMR2_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{   LPUART3_DriverIRQHandler();
}

WEAK void LPUART4_IRQHandler(void)
{   LPUART4_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{   LPUART5_DriverIRQHandler();
}

WEAK void LPUART6_IRQHandler(void)
{   LPUART6_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{   ASRC_DriverIRQHandler();
}

WEAK void BBNSM_IRQHandler(void)
{   BBNSM_DriverIRQHandler();
}

WEAK void SYS_CTRL1_IRQHandler(void)
{   SYS_CTRL1_DriverIRQHandler();
}

WEAK void TPM3_IRQHandler(void)
{   TPM3_DriverIRQHandler();
}

WEAK void TPM4_IRQHandler(void)
{   TPM4_DriverIRQHandler();
}

WEAK void TPM5_IRQHandler(void)
{   TPM5_DriverIRQHandler();
}

WEAK void TPM6_IRQHandler(void)
{   TPM6_DriverIRQHandler();
}

WEAK void RTWDOG3_IRQHandler(void)
{   RTWDOG3_DriverIRQHandler();
}

WEAK void RTWDOG4_IRQHandler(void)
{   RTWDOG4_DriverIRQHandler();
}

WEAK void RTWDOG5_IRQHandler(void)
{   RTWDOG5_DriverIRQHandler();
}

WEAK void Reserved98_IRQHandler(void)
{   Reserved98_DriverIRQHandler();
}

WEAK void TEMPSENSOR_IRQHandler(void)
{   TEMPSENSOR_DriverIRQHandler();
}

WEAK void Reserved100_IRQHandler(void)
{   Reserved100_DriverIRQHandler();
}

WEAK void LDO_1P8_IRQHandler(void)
{   LDO_1P8_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{   USDHC1_DriverIRQHandler();
}

WEAK void USDHC2_IRQHandler(void)
{   USDHC2_DriverIRQHandler();
}

WEAK void Reserved104_IRQHandler(void)
{   Reserved104_DriverIRQHandler();
}

WEAK void TMR2_IRQHandler(void)
{   TMR2_DriverIRQHandler();
}

WEAK void LDO_1P0_IRQHandler(void)
{   LDO_1P0_DriverIRQHandler();
}

WEAK void MECC1_IRQHandler(void)
{   MECC1_DriverIRQHandler();
}

WEAK void MECC2_IRQHandler(void)
{   MECC2_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{   ADC1_DriverIRQHandler();
}

WEAK void DMA_ERROR_IRQHandler(void)
{   DMA_ERROR_DriverIRQHandler();
}

WEAK void DMA_0_IRQHandler(void)
{   DMA_0_DriverIRQHandler();
}

WEAK void DMA_1_IRQHandler(void)
{   DMA_1_DriverIRQHandler();
}

WEAK void DMA_2_IRQHandler(void)
{   DMA_2_DriverIRQHandler();
}

WEAK void DMA_3_IRQHandler(void)
{   DMA_3_DriverIRQHandler();
}

WEAK void DMA_4_IRQHandler(void)
{   DMA_4_DriverIRQHandler();
}

WEAK void DMA_5_IRQHandler(void)
{   DMA_5_DriverIRQHandler();
}

WEAK void DMA_6_IRQHandler(void)
{   DMA_6_DriverIRQHandler();
}

WEAK void DMA_7_IRQHandler(void)
{   DMA_7_DriverIRQHandler();
}

WEAK void DMA_8_IRQHandler(void)
{   DMA_8_DriverIRQHandler();
}

WEAK void DMA_9_IRQHandler(void)
{   DMA_9_DriverIRQHandler();
}

WEAK void DMA_10_IRQHandler(void)
{   DMA_10_DriverIRQHandler();
}

WEAK void DMA_11_IRQHandler(void)
{   DMA_11_DriverIRQHandler();
}

WEAK void DMA_12_IRQHandler(void)
{   DMA_12_DriverIRQHandler();
}

WEAK void DMA_13_IRQHandler(void)
{   DMA_13_DriverIRQHandler();
}

WEAK void DMA_14_IRQHandler(void)
{   DMA_14_DriverIRQHandler();
}

WEAK void DMA_15_IRQHandler(void)
{   DMA_15_DriverIRQHandler();
}

WEAK void DMA_16_IRQHandler(void)
{   DMA_16_DriverIRQHandler();
}

WEAK void DMA_17_IRQHandler(void)
{   DMA_17_DriverIRQHandler();
}

WEAK void DMA_18_IRQHandler(void)
{   DMA_18_DriverIRQHandler();
}

WEAK void DMA_19_IRQHandler(void)
{   DMA_19_DriverIRQHandler();
}

WEAK void DMA_20_IRQHandler(void)
{   DMA_20_DriverIRQHandler();
}

WEAK void DMA_21_IRQHandler(void)
{   DMA_21_DriverIRQHandler();
}

WEAK void DMA_22_IRQHandler(void)
{   DMA_22_DriverIRQHandler();
}

WEAK void DMA_23_IRQHandler(void)
{   DMA_23_DriverIRQHandler();
}

WEAK void DMA_24_IRQHandler(void)
{   DMA_24_DriverIRQHandler();
}

WEAK void DMA_25_IRQHandler(void)
{   DMA_25_DriverIRQHandler();
}

WEAK void DMA_26_IRQHandler(void)
{   DMA_26_DriverIRQHandler();
}

WEAK void DMA_27_IRQHandler(void)
{   DMA_27_DriverIRQHandler();
}

WEAK void DMA_28_IRQHandler(void)
{   DMA_28_DriverIRQHandler();
}

WEAK void DMA_29_IRQHandler(void)
{   DMA_29_DriverIRQHandler();
}

WEAK void DMA_30_IRQHandler(void)
{   DMA_30_DriverIRQHandler();
}

WEAK void DMA_31_IRQHandler(void)
{   DMA_31_DriverIRQHandler();
}

WEAK void DMA4_ERROR_IRQHandler(void)
{   DMA4_ERROR_DriverIRQHandler();
}

WEAK void DMA4_0_1_IRQHandler(void)
{   DMA4_0_1_DriverIRQHandler();
}

WEAK void DMA4_2_3_IRQHandler(void)
{   DMA4_2_3_DriverIRQHandler();
}

